app/controllers/landings_controller.rb

  def savemail
    @mailinfo = Mailinfo.new
    @mailinfo.email = params.permit(:email)[:email]
    @mailinfo.question = params.permit(:question)[:question]
    @res = @mailinfo.save
---
INSERT INTO "mailinfos" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "306587073@qq.com"], ["created_at", "2015-04-02 15:29:38.344892"], ["updated_at", "2015-04-02 15:29:38.344892"]]